# Assignment Pandas 2

Q1. List any five functions of the pandas library with execution.

loc, iloc, sort_values, fillna, drop

In [1]:
import pandas as pd

In [31]:
import pandas as pd
  
# Creating the dataframe 
df = pd.DataFrame({"A":[1, 5, 3, 4, 2],
                   "B":[3, 2, 4, 3, 4],
                   "C":[2, 2, None, 3, 4],
                   "D":[4, 3, 6, 12, None]},
                   )

# Print the dataframe
df

   A  B    C     D
0  1  3  2.0   4.0
1  5  2  2.0   3.0
2  3  4  NaN   6.0
3  4  3  3.0  12.0
4  2  4  4.0   NaN

In [7]:
df.loc[0:3,'A']

0    1
1    5
2    3
3    4
Name: A, dtype: int64

In [8]:
df.iloc[0:5,1:4]

   B    C     D
0  3  2.0   4.0
1  2  2.0   3.0
2  4  NaN   6.0
3  3  3.0  12.0
4  4  4.0   NaN

In [9]:
df.sort_values('A')

   A  B    C     D
0  1  3  2.0   4.0
4  2  4  4.0   NaN
2  3  4  NaN   6.0
3  4  3  3.0  12.0
1  5  2  2.0   3.0

In [12]:
df.fillna(100,inplace=True)
df

   A  B      C      D
0  1  3    2.0    4.0
1  5  2    2.0    3.0
2  3  4  100.0    6.0
3  4  3    3.0   12.0
4  2  4    4.0  100.0

In [13]:
df.drop('B',axis = 1)

   A      C      D
0  1    2.0    4.0
1  5    2.0    3.0
2  3  100.0    6.0
3  4    3.0   12.0
4  2    4.0  100.0

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [19]:
df = pd.DataFrame({"A":[1, 5, 3, 4, 2],
                   "B":[3, 2, 4, 3, 4],
                   "C":[2, 2, 1, 3, 4]},
                   )
new_ind = [1]
for i in range(1,len(df)):
    new_ind.append(i+2)
df2 = df.reindex(new_ind)
df2

     A    B    C
1  5.0  2.0  2.0
3  4.0  3.0  3.0
4  2.0  4.0  4.0
5  NaN  NaN  NaN
6  NaN  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [12]:
val = pd.DataFrame({"Values":[10, 20, 30, 40, 50]})
sum = 0
for i in range(0,3):
    sum += val['Values'][i]
sum

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [39]:
t = pd.DataFrame({"text":['HI','How are you','Hello']}) 
t['text']
t['Word_Count'] = t['text'].apply(lambda x: len(str(x)))
t

          text  Word_Count
0           HI           2
1  How are you          11
2        Hello           5

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [45]:
# SHape gives no of rows and columns while size gives total values in a df
s = df.shape
s1 = df.size
print(s,s1)

(5, 5) 25

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [47]:
e = pd.DataFrame({"email":['hk@gmail.com',"jphn1@gmail.com"]})
e['Username'] = e['email'].apply(lambda x : x.split('@')[0])
e

             email Username
0     hk@gmail.com       hk
1  jphn1@gmail.com    jphn1

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [5]:
z = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
z

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [10]:
z[(z['A']>5) &( z['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [13]:
s = pd.DataFrame({'Values' : [5, 9, 8, 5, 7, 8, 1, 2, 3,
                      4, 5, 6, 7, 8, 9, 5, 3]})
s.mean()

Values    5.588235
dtype: float64

In [14]:
s.std()

Values    2.45099
dtype: float64

In [15]:
s.median()

Values    5.0
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage'   contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [18]:
df = pd.DataFrame({"Sales":[1788,8887,5000, 7883, 5674, 2999,8761]})
df1 = pd.DataFrame([['2019-11-10'], ['2019-11-11'], ['2019-11-12'], ['2019-11-13'], ['2019-11-14'], ['2019-11-15'], ['2019-11-16']], columns=['Date'])

In [19]:
df1

         Date
0  2019-11-10
1  2019-11-11
2  2019-11-12
3  2019-11-13
4  2019-11-14
5  2019-11-15
6  2019-11-16

In [20]:
df['Date'] =df1['Date']

In [21]:
df

   Sales        Date
0   1788  2019-11-10
1   8887  2019-11-11
2   5000  2019-11-12
3   7883  2019-11-13
4   5674  2019-11-14
5   2999  2019-11-15
6   8761  2019-11-16

In [29]:
df['MovingAverage'] = df['Sales'].rolling(2).mean()

In [30]:
df

   Sales        Date  MovingAverage
0   1788  2019-11-10            NaN
1   8887  2019-11-11         5337.5
2   5000  2019-11-12         6943.5
3   7883  2019-11-13         6441.5
4   5674  2019-11-14         6778.5
5   2999  2019-11-15         4336.5
6   8761  2019-11-16         5880.0

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [35]:
d = {
'date1': ['2019-09-11', '2019-09-12', '2019-08-02','2019-10-11', '2019-09-24', '2019-11-11']
}
df = pd.DataFrame(d)

In [36]:
df

        date1
0  2019-09-11
1  2019-09-12
2  2019-08-02
3  2019-10-11
4  2019-09-24
5  2019-11-11

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Pandas is the library that needs to be imported.